# IsAutomaticLanding Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsLanding..::..IsAutomaticLanding Property
StairsLanding Class See Also
---
True if the landing is an automatic landing, False otherwise.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsAutomaticLanding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsAutomaticLanding As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsAutomaticLanding {
	bool get ();
}
```

# See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace